[
 {
   "Comment": "It was very enjoyable to watch in the cinema. The expected theories turned out to be true. Acting was great. The script was pretty good. I will watch it for the second time) It was the best Spiderman movie in my opinion. It's also one of the best Marvel movies. Be sure to watch it in the cinema!"
 },
 {
   "Comment": "This is a movie made purely to satisfy the fans and there should be no doubt about that. No Way Home, in my opinion, is even better than Homecoming and Far From Home, and pretty much one of the best MCU movies of all time. It's a simple story, but the execution is fantastic. Even the smallest of surprises have a huge impact, and I could feel that in the theatre as I joined several other Spider-Man fans cheer out for both heroes and villains. The action sequences were brilliant; seeing them in 3D is totally worth the price of admission. Every actor delivered a believable, realistic performance, and especially our lead actor Tom Holland. The visual effects too were top notch and the editing was stupendous. Two and a half hours flew by real quick while watching this popcorn action entertainer. It won't be fair to reveal anything, so here I conclude my review, and recommend you to check out this new world of Spidey-ness on the big screen and in 3D. And once you've seen it, please don't spoil it for others, just like you won't want it spoiled for yourself."
 },
 {
   "Comment": "I'm unsure of why this has received a high IMDb rating. It's rubbish and slow and nonsensical. Instead this film rakes in all past cast members for some obscure reminiscent feelgood film. Trash at its Hollywood best. You've been warned."
 },
 {
   "Comment": "Superhero extravaganza! Spider-Man NWH didn't meet my expectations, it exceeded them. The most emotionally resonant MCU film so far. This movie is worth every excruciating moment we had to wait. The visuals, the score, the emotions, the story, and ofc the fan-service. This film understands spider-man fans like no other spider-man film before it. Truly a celebration of the most beloved character in the best way possible!"
 },
 {
   "Comment": "My expectations for this film were off the chart due to what I had heard and read about how great it is. What it does deliver is plenty of spectacle. But a great film needs more than that. The story also moves along with some pace. But emotional impact should never be sacrificed for expediency. In short, this is an enjoyable film, but there have been better Marvel films."
 },
 {
   "Comment": "My expectations for this film were off the chart due to what I had heard and read about how great it is. What it does deliver is plenty of spectacle. But a great film needs more than that. The story also moves along with some pace. But emotional impact should never be sacrificed for expediency. In short, this is an enjoyable film, but there have been better Marvel films. There is one scene that stands above the rest. And it is guaranteed to bring a smile to the lips of any Marvel fan. It has so much subtext and it is so unexpected.It ends with a tee-up for the next chapter, of course. I just hope that one focuses more on the characters and less on the effects. It certainly has that possibility, given where this episode ends."
 },
 {
   "Comment": "First of all, i was so grateful to be experience this movie in theaters, with a great audience that as excited as me, they were clapping and the movie deserve it, Spider-Man No Way Home is everybody's dream, it's an exciting movie, with an epic story, and phenomenal performance, it just amazing, it's incredible, it's fantastic, it's mind blowing, it's an experience that i will never forget, once cross in my mind that this one is probably even better than Avengers Endgame, but as the time goes, it's still not reach that level but that really doesn't mean anything, both movie are epic, Spider-Man No Way Home is one of the greatest movie i've ever watch, one of the greatest superhero movie i've ever watch, and it simply The Best Movie Of The Year."
 },
 {
   "Comment": "If you thought the Marvel Universe had reached it's climax with Avengers Endgame, then think again, this was superb, and far more entertaining than any other Spiderman movie. Very cleverly done, mixing laughs and tears. If this is the way phase 4 is going to go then bring it on. This is the reason you go to the cinema, wonderful entertainment."
 },
 {
   "Comment": "An exhilarating wild ride from start to finish which is perfect for a runtime of 2 hours 28 minutes! I'm glad I managed to see in IMAX at 11:40 AM well worth it especially with an audience that reacted loudly to exciting bits. I absolutely love the grand scale of everything from the multiverse, characters, massive budget, tingling sense is so well done, and the humor is spot on. Fans or not of the movies Spider-Man: No Way Home is crystal smooth flow of excellence!"
 },
 {
   "Comment": "They did it! A Spider-Man trilogy finally stuck the landing! Spider-Man: No Way Home is an impressive culmination of the films that came before it, with an engaging storyline, exciting action, laugh out loud moments, and dramatic consequences. The beginning climb is a little slow, but it's an exhilarating ride once things get swinging. I don't exactly know how this movie will hold up after multiple viewings, as there are some plot points that don't quite make sense when you start to think about them, but I thoroughly enjoyed myself this first time."
 },
 {
   "Comment": "This was one of the most impressive cinema experiences I ever had. Spider-Man: No Way Home really had it all. I still have no words for what I just witnessed."
 },
 {
   "Comment": "I was disappointed, they have run out of ideas so they bring out Spider-Man greatest hits. I found it rather boring and I think it's getting silly all these cross over films but the masses keep going so they will continue to make them. It's a good film for die hard fans but for the casual viewer it lacks any real substance."
 },
 {
   "Comment": "Yet another Spiderman movie... These just keep getting cheesier and cheesier. Effects are even starting to get subpar. Actor choice and scripts are also getting super cringe. They are in full in cash grab mode now... weewww!"
 },
 {
   "Comment": "I just watched the movie at the theatre and you really don't wanna miss this one out. I will make it simple, the movie will live to your expectations If not exceed them, however, during the first half of the film you won't witness anything new. Every fight scene is in the trailer and I LITREALLY mean every fight scene. But don't get me wrong they were awesome and of course not the whole fight scenes. It's also full of talking and a bit more funny lines than usual. You also have a very very silly plot that was based on some character's opinion and lead to all the events of the film and then comes on of the best plots and entrances near the beginning of the second half that you will ever witness and here comes the second half of the movie and trust me it was beyond awesome. The VFX of this film is breathtaking. Every action sequence is very complicated and loaded with tons of details. The visuals are insaaane. You also have a couple of Spidy suits and most importantly you won't be disappointed with anything you might be expecting. You have Dr. Strange and believe me it was one of the best times you will see him along with another hero cause Benedict is such a great actor. Zendaya role however was meaningless but you know she is Spidy's GF. The Finale of the film is beyond great and feels like a dream come true for all fans around the world that will leave you full of emotions, amazed and shocked! Even the two post credit scenes made everyone yell in the theatre (who yelled for more than half of the movie). Not a perfect movie and a lot of things may not make sense and will make your brain full of questions like Endgame and that's what make a movie a great one. I have now experienced the whole trilogy at the theatre and there is no doubt that this one is the best. I hope you just relax and enjoy it cause as a fan I'd give it a 10/10 easily but a solid 9/10 with love and joy is fair enough."
 },
 {
   "Comment": "I can understand this movie being popular with kids,but seeing adults saying this is a masterpiece of cinema is insulting. Mainstream movies are usually low quality for low iq audience and this movie proves it."
 },
 {
   "Comment": "This film has a strong story and emotional core I haven't seen too often in marvel. I laughed cried sat on the edge of my seat this film is amazing and a must watch for all marvel fans. It may not go as crazy as some will hope but this is at its centre a character piece about Peter Parker and it sets him up for a great arc. The multiverse stuff is great with many great villains coming back into the fold. There are other surprises aswell some you might be able to guess some you might not."
 },
 {
   "Comment": "The most satisfying way to end a trilogy. This movie is chef's kiss to all marvel fans. I was laughing crying and smiling at the same time. So many emotions and awesome picture."
 },
 {
   "Comment": "For a moment every fan on the planet was eating good, we all got together, laughed, cried, got pure excitement, and rejoiced as we saw our favorite spider-men on the screen together. Pure treat, executed insanely well. Great job marvel."
 },
 {
   "Comment": "Wow, the greatest movie after Avengers End Game. Thank you, Marvel, and thank you, Sony. Comedy, drama, romance and enthusiasm are all present in this movie. The ending is very, very sad."
 },
 {
   "Comment": "I highly enjoyed Spider-Man: No Way Home. It was a great culmination of all three properties of the Spider-Man franchise blending Sam Raimi's Spider-Man universe, along with Marc Webb's Spider-Man universe, into the Marvel Cinematic Universe into Marvels famed \"Multiverse\". My only real quarrel with the film was that it spent too much time re-introducing the characters we already knew from previous movies and now timelines. All the character performances were superb and endearing."
 },
 {
   "Comment": "This was just perfect. It borders on Endgame for my all time favorite Marvel movie. This is how you do nostalgia right. What are you doing still reading reviews about this movie, go and watch it already!"
 },
 {
   "Comment": "The first Marvel movie I couldn't watch all the way through. Poor character representation, meaningless, silly story. Viewing is recommended for children only."
 },
 {
   "Comment": "I loved every second of the movie. It tied EVERYTHING together good, i allways said Garfield was the best Spiderman due to his ability to show emotion, but damn, do Holland give him a fight for his podium! This movie is by far the best Spiderman movie ever made!"
 },
 {
   "Comment": "Couldn't even finish this drivel... Firstly : Pattinson is a good actor but doesn't fit Batman's role ...Film is way too long and boring , action is underwhelming ...Overall a big disappointment... Can't recommend it at all…"
 },
 {
   "Comment": "I just don't enjoyed it at all. It's too long, bored me to dead. I loved the previous Batman movies but this isn't as good as these movies . Moreover,It's ratings make me sad and laugh at the same time. It's not good enough compared to these movies, maybe, I just had too much high exceptions about this which eventually fall flat."
 },
 {
   "Comment": "Robert P is a terrible Batman. Absolutely no Bat-charisma at all. The Riddler character is a complete bore! I hated all of this film. I certainly do not understand the good reviews. It's not close to the Dark Knight caliber. Please do not make a sequel."
 },
 {
   "Comment": "It's outrageous how some people are saying this is better than the Dark Knight movies. This movie doesn't come near any of the dark knight trilogy. It had some really fun scenes like most of the riddler scenes were good. But it just dragged on with so much dialogue that didn't seem to be that important. I'd actively avoid watching this movie again."
 },
 {
   "Comment": "I'll say it started pretty good and I liked the cinematography. But I thought it dragged on, and the social commentary on destroying \"white privileged men\" was ironic as that's what Batman is- a privileged white rich guy who can mascarade as a vigilante because he's rich and has all the free time to do so; and we feel for him because boo boo he's an orphan. This was a very obvious \"woke\" fest. I like the diversity but it's when they blatantly shove rhetoric down your throat that it starts to become cringey. Pattinson was so sleepy, like Joe Biden in a Batman suit sleepy. Joker is my favorite movie of all time and I feel like they tried to go for that but it just had too many missteps. I did like Farrell as the Penguin and the Riddler was basically Dexter the Anti-hero..."
 },
 {
   "Comment": "I never thought that I would view a worse DC movie than Catwoman or the Harley Quinn movie. I was sorely mistaken. The Batman by far is the absolute biggest mistake in any comic book adaptation. The casting was wrong - there was not one cast member who had a good performance; the script was pitiful - it was too long and all over the place; the direction was terrible and the editing was questionable. Nothing was a positive about this film except the end credits where you could escape the misery."
 },
 {
   "Comment": "Wasn't a fan of Emo Batman. Sorry Robert Pattinson. Film was just a bit bleh and felt like it was trying too hard to emulate Christopher Nolan and David Fincher. In the end, the mystery was a bit meh and not worth the three hours of what was mostly a run-of-the-mill Superhero film lacking much excitement or thrill. The Riddler was a bit lame too. Forgotten most of the movie and characters already. Underwhelming."
 },
 {
   "Comment": "Detective Batman at its peak! Great storyline. Just as dark a universe as we've come to expect from DC. The gloomy, gritty, dark tone of this film is exactly what I wanted. When you think the movie is over, there's more. Beautiful cinematography. Great score."
 },
 {
   "Comment": "Could not believe that was Colin Farell under the makeup as Oz. It's not so much this is a bad movie, it isn't, but it's not really a great movie. The sets, the atmosphere, the mood--all are Gotham the TV series. The Batman here is gritty and intense but brings nothing new or innovative to the audience. Basically a C- attempt."
 },
 {
   "Comment": "I really don't understand all the love for this new Batman movie. It was very long and boring. It was filmed with no light. You can barely see anything. Ever character is speaking just above a whisper or mumble. The story was weak. The villains were not interesting. There were a couple of stupid scenes in the movie too. Emo Batman was not cool. I know Pattinson can act, but the script and direction let him down here. Riddler and Penguin were wasted here too. Bottomline, this movie is way over rated. Save your time and money."
 },
 {
   "Comment": "The Batman is a movie that you can expect these days: a lot of special effects and the rest is fast produced mediocrity. Not a total fail but compared to some of the other epic and even iconic movies of (seemingly) long gone times, The Batman tastes like convenient fast food compared to Haute Cuisine."
 },
 {
   "Comment": "Everything about this move is a glaring testament to how far Hollywood has fallen. All I saw was a weak little boy and a supporting cast to fit it. He just doesn't fit the roll. I've met 90 year old military vets that have more metal than this supposed super hero. Hell I'd prefer to watch Ryan Reynolds version of the Green Lantern any day over this."
 },
 {
   "Comment": "Matt Reeves The Batman is a hell of a movie, it is the darkest live action Batman movie ever made, and the longest one too, The Batman fills with a top notch action sequence that not only exciting, but it's cinematic too, the cinematography was just incredible, Michael Giacchino The Batman theme song has just become one of my favorite movie theme song ever, it's enduringly great, the action is perfect itself without the theme but they making it even more perfect with the theme in the background especially when Batman shows up, it really making me hyped more because of that, Colin Farrell transformation is as amazing as his performance as The Penguin, Paul Dano performance is giving me a Heath Ledger Joker vibes but not trying to be Heath Ledger Joker which is still great, Paul Dano The Riddler is still a terrifying and a very disturbing villain, Zoe Kravits performances as Catwoman was amazing though she is not as wild as Michelle Pfeiffer in Batman Returns but boy did her gesture and look is as wild as Michelle Pfeiffer, and the Catwoman fighting sequence is definitely a win for Zoe and i did still like her a lot in here, and in the end we got The Batman himself, Robert Pattinson, all i can say about him as The Batman is that i hope everybody is starting to know him as the guy who play The Batman which is a really good movie and not the guy who play in the horrible Twilight film anymore because he is indeed an awesome Batman, now he was become my second favorite Batman next to Christian Bale in number one still, the story of The Batman itself is great, and my only problem with the movie is that there is quite a lot of particular scene that for me are just very slow or too slow, it's not boring but i feel like they can make it a little bit faster, if it's only one or two or three scene i probably still can forgive it but unfortunately it happens more than that, but at in the end The Batman is still a hell of a great movie, it's still amazing and it's still incredible, i was impress by most of the thing that happens, i was excited, i was hyped, i was stunt by all the amazing thing that they've done, The Batman is fire!!!."
 },
 {
   "Comment": "THE BATMAN (2022) *** Robert Pattinson, Zoe Kravitz, Jeffrey Wright, Colin Farrell, Paul Dano, John Turturro, Andy Serkis, Peter Sarsgaard. Filmmaker Matt Reeves pulls out all the stops in this even darker adaptation of the Bob Kane comic book hero with Pattinson standing tall and brooding as Bruce Wayne employing vigilante style justice as The Caped Cursader while Gotham quakes under the siege of the homicidal Riddler (Dano affectively disturbing) and gaining an unlikely ally in Selina Kyle (ass-kicking Kravitz in pre-Catwoman mode). Arresting visuals thanks in large part to ace cinematography by Greig Fraser and James Chinlund's production design all aided by the foreboding score by Michael Giacchino full of bombast and dread. Farrell, under a ton of unrecognizable prosthetics, has a field day in getting in touch with his inner Robert De Niro as The Penguin. By all means see it in IMAX!"
 },
 {
   "Comment": "For better or worse (mostly better), The Batman is when he's detective first, superhero second. A bleak yet thrilling noir but also with a glimpse of exhilarating hope. It doesn't hurt really if we're having a new Batman film, especially if it took a riveting route like this. Pattinson and Kravitz were explosive together."
 },
 {
   "Comment": "I think at one point during this interminably long movie we forgot we were watching it. Just keeps going on with the same stuff that worked years ago when it was new and somewhat interesting. Doubling up on the pointless and constant whispering when there's no reason to whisper, the world seemingly without a single visible source of light... Freakish bad guys insulting Ledger's legacy.... Made worse because they forgot to include any hint at all about how the Riddler could have possibly funded such an extravagant, long term plot to annihilate an entire city."
 },
 {
   "Comment": "This is a guy who is called Batman / Bruce Wayne but he isn't. Other characters have names from the comics but they aren't those characters. They took a crime drama, sprinkled in a little action and gave the characters Batman names. It's SO long. Every time I thought it was ending nope there's more. 3 hours in total, plus the 25 minutes of previews you sat through it you see it in the theater."
 },
 {
   "Comment": "The most realistic Batman film ever made! I've never seen batman struggle that much. The script was really tight and even though it's 3 hours long, I didn't see any superfluous details. Top-notch visuals, sound and acting. The soundtracks of the movie were really good, after watching the movie it just stuck in my head."
 },
 {
   "Comment": "When the film was announced, the question that overshadowed the project was: how do you revolutionize something that has already been made iconic by directors like Tim Burton, like Zack Snyder or even like Christopher Nolan? Well, the question to that answer today is Matt Reeves. The Batman is a revolutionary, innovative, unique and spectacular project; a revolutionary film from the very first scene, marked by a comic narrative, a theater of details and spectacularity, a palette with a noir-type graphic novel tone and with characters that seem to be introduced for the first time, but the genius lies in honoring to the investigative side of the most famous detective in the world, which resolves in a complete success. Matt Reeves manages to give to the fans, to the legacy of Batman and to comics in general, a unique masterpiece of its kind, unprecedented and that looks only and only forward. Film that is exhibited with a perfect photograph, signed by Greig Fraser, which with its soft and reddish colors, enhances every emotion, every look, every moment, every action; this one, directed by Reeves, manages to create an atmosphere typical of the best Batman comics, focusing above all on the depth of each scene, look and context. Above all, it should be emphasized that Matt Reeves has concentrated a lot on enhancing the character of Batman in every aspect, with dedicated and precise shots aimed at capturing any emotion that leaked from the mask, as well as enhancing his gestures and all non-verbal communication. Perfect cast that moves on the screen like a perfect symphony, from the unrecognizable and surprising Colin Farrell, to the fearsome John Turturro, from the splendid Zoë Kravitz to the excellent Andy Serkis and Jeffrey Wright as the new Commissioner Gordon (which he completely masters), without forgetting the perfect, as always, Paul Dano in the role of a unique and disturbing Riddler, but the one on whom there were too many doubts, but all fallen down immediately from the first scene, is surely Robert Pattinson, who gives us a young Batman, immature and resentful, full of energy and revenge, but who certainly has a lot to learn from himself and from the environment / people around him, practically an unforgettable and more than unique interpretation. Obligatory mention goes to Michael Giacchino who composes one of the best soundtracks ever, managing to give the film the tone that has been so sought after, therefore constituting one of the most important pieces of this extraordinary puzzle. The Batman by Matt Reeves is an inimitable masterpiece, with a unique and unprecedented style, practically a profound revolution."
 },
 {
   "Comment": "It's the first major Batman movie in 10 years. What has changed? For starters, Robert Pattinson is the best Batman since Christian Bale, perhaps even better! Matt Reeves builds on what Nolan established before, and amps up the darkness and grit. Colin Farrell appears utterly unrecognizable as a mobbed-up Penguin. Paul Dano is chilling to the bone as The Riddler, who is revamped as a realistic psychopathic mashup of Jigsaw and the Zodiac killer. Zoe Kravitz is cast perfectly as Catwoman. The Batman offers a lot of really cool things, but doesn't add anything new to the franchise. It's a standard cop drama, with Batman. I was expecting a game-changer, and maybe I shouldn't have been. Fans of the lore will be throughly satisfied."
 },
 {
   "Comment": "After spending 3 hours watching this movie.... I felt like this batman is so 'moody\"? The way he talks & his facial expression are like having mental issue? Not the super hero I am expecting to see. The romance in this movie happens out of blue? Also, the film doesn't have to go 3 hours long."
 },
 {
   "Comment": "It was so good! The beginning, the narration, Bruce's voice, his accent, Gotham City, music and sounds... it felt like I'm reading the comic and the pages come alive in my head! It was great! And I live violence, action, crime... this movie has everything! Beautiful car scenes to strong fight scenes to memorable and emotional and dark scenes to those detective scenes... I can't find the right words. You have to watch it. I was told it's about 3 hours but didn't feel like it. I could easily go on for another hour or more. And one last thing, make sure to watch it on a big screen because it's very dark and detailed, a movie theatre would be the best place to feel the movie as a whole!"
 },
 {
   "Comment": "The Batman creates a grim & gloomy atmosphere, and it moves along so slowly that you could almost fall asleep to it. However, if you did, you'd probably have nightmares. This movie made me believe that Robert Pattison could be Batman, although I'm not entirely sold on him as Bruce Wayne. Paul Dano is disturbingly demented in his role as the Riddler, and Colin Farrell is absolutely unrecognizable as the Penguin. I liked this new take on Batman, but I didn't love it."
 },
 {
   "Comment": "Not sure why this is rated so highly. This was the worst Batman movie ever! I loved the Batman trilogy with Christian Bale but this was just long and boring."
 },
 {
   "Comment": "Perfect masterpiece!!! That's all that should be told!!! This is not action heavy but very plot story driven filled with fantastic performances!!! So expect a visually stunning story driven movie than a big action driven Batman movie unlike its predecessors!!!! Truly different and perfect!!!!"
 },
 {
   "Comment": "The movie is lousy, although it is painful to accept it, being a fan does not mean that one loses the critical sense. There were many characters and in the end none of them shone, maybe the elf. The interesting part starts after the 75th minute, the lizard and the sandman were less relevant than the extras."
 },
 {
   "Comment": "In the last few years we are experiencing a lesser performance in Marvel movies, based a lot on comedy and childishness and completely losing the importance of a well-crafted script. Definitely, this new era of action-comedy movies without a well-crafted script make me feel very sorry for them and a little bit disgusted. I'll stick a thousand times with Spiderman from 2002, and only with the first ones of the UCM."
 },
 {
   "Comment": "This is definitely the highest grossing film of the season, and the one with the biggest budget of the saga. Set in New York City, as it could not be otherwise, the film has magnificent special effects, lots of action, great music and an exceptional cast, although what will attract the attention of many will be the story."
 },
 {
   "Comment": "If you count on being disappointed, you'll never be disappointed at all. The director of the saga starring Tom Holland in the role of Spider-Man gets back behind the cameras to go further with Marvel's latest, where his screenwriters have made a great effort to keep us expectant during the almost 150 minutes that the feature film lasts... and they have succeeded."
 },
 {
   "Comment": "We are watching movies where every ten seconds someone makes a joke or a comment full of sarcasm. Every opportunity is good to remember that Iron Man is a millionaire with a good heart. Every sequence is directed to be applauded at the right time. Let's see, even Peter Parker has that powerful aesthetic, as if he were the most popular kid in his class. He makes noise in every scene, I don't see him anywhere being Spider-Man."
 },
 {
   "Comment": "Lousy, I spent my time my money and I got bored, I expected more after so many spoilers and that they come out with meaningless conversations, as well as many scenes without logic, too much sarcasm just to lift the scenes with Dr strange, no doubt the quality and level of acting shows, too much Tom Holland does not fill the role I'm sorry."
 },
 {
   "Comment": "Spider-Man No Way Home the third part starring the great Tom Holland, I can truly confirm that it was one of the best experiences I have ever had in my life. Marvel and Sony did a great job. Spider-Man No Way Home, is the best Spider-Man movie ever, he will always be the biggest favorite hero for everyone and for the next generations. I haven't stopped thinking about the last scene, that scene made me feel something different something inside me, it even reminded me of my childhood, Thank you Marvel, Thank you Sony."
 },
 {
   "Comment": "My point of view, about the movie, is that it is directed more for children than for the general public, there are not many action scenes, Spiderman is seen every time crying and the entrance of the other Spiderman is not so epic, it's just like they entered and nothing more, the emotion loses strength to see that they enter as if nothing and in the final fight they spend more fighting among them that is not understood and the bad guys who fight but are not coordinated. It would have been more exciting to see the entrance of the other Spiderman and the villains in a different way."
 },
 {
   "Comment": "To start with the bad, I feel that the script lacked a bit of solidity. They shoved too many jokes into their villains, especially Octopus. They also did less to Dr Strange. Holland's spiderman for much of the movie remained more naive than charismatic. The humor is the same as always, childish and unnecessary, the characters like Flash, MJ and Peter's sidekicks more of the same."
 },
 {
   "Comment": "The chemistry between the three spidermen, WAS PERFECT, the jokes they make, their interaction, their charisma, their comparisons, references and homages to their universes. Willem Dafoe as the green goblin, had the best development. The dramatic ending and the emotional weight it conveys, did not bring me to tears as in Endgame but very emotional and I think it was the best way to close the trilogy. Finally, what left me quite satisfied was the evolution and development of Peter, as well as the end itself leaving Tony's suit to use one of his own, it was a good reference to the comics."
 },
 {
   "Comment": "No way home is not the best Spiderman movie, it is a movie with mistakes and improvable aspects but even with details like that it is a visual spectacle that unites three generations of Spiderman, takes us to new and exciting directions for the UCM and somehow manages to redeem much of the mistakes they made in the past. I could simply say it's a great movie and everything else but as they say out there it's better to stop and analyze such a movie a bit rather than overvalue it because it has lights and colors."
 },
 {
   "Comment": "It is a movie from which much was expected and it delivered pretty much what was promised the comedy role is enjoyable and satisfying as so many references to previous spider-man movie franchises in my opinion it is the perfect spider-man movie it has a deluxe cast and the performances are simply admirable I hope you enjoyed the movie."
 },
 {
   "Comment": "Starting with a simple plot and the monotony of Marvel. We find a very repetitive soundtrack, a saturation of American humor and sometimes very slow speeds in the plot. It seems to me that they play with nostalgia, but it is not a drawback, it is appreciated to see the three generations, and it gives some impotence not to have taken full advantage of the potential. In short, it is still a very commercial movie with a Marvel story."
 },
 {
   "Comment": "The best spider-man movie I've seen honestly and not only because the 3 actors who have played Spider-man are in it but because I've always liked Tom Holland's spider-man movies and this is the best of the 3 without a doubt. I think that for professional critics it may not be such a good movie but let's keep in mind that this is commercial cinema. Personally I think it is a very good movie, entertaining for arachnid fans and for the general public."
 },
 {
   "Comment": "In my opinion, entertaining movie. Much more mature than the previous ones, leaving aside the \"childishness\" that characterizes Disney. I totally recommend it. It is worth mentioning that it has a weak plot, but it makes up for it with emotion."
 },
 {
   "Comment": "Spiderman no way home is a real disappointment for many reasons. First of all we again see Peter Parker (Tom Holland) being a teenager who learned nothing from being a superhero in the previous movies. He again acts like a gullible, dumb and clueless kid. And all the characters around him also act the same way, Aunt May, MJ, Ned, and mainly Doctor Strange. Secondly, The multiverse plot is very forced. The worst part of the whole movie without a doubt was the entrance of Spider-Man one (Tobey Maguire). Plain, old, and boring. The best Spider-Man of all time barely adds to the movie, I was expecting a super one entry."
 },
 {
   "Comment": "The best of the movie are the farewells that are made with feeling. For the rest much to object; Doctor Strange is not up to par, very poor and without strength, the villains are halfway as well as the two Peter Parker. In conclusion, I was expecting a great high after the two and a half hours and it was halfway through the multiverse."
 },
 {
   "Comment": "It is to be welcomed that this new installment moves away from the last \"far from home\" very oriented to the teen audience (it almost seemed like an \"American high school movie\" or Disney series episode) and that forgot a little of the Marvel action universe. Now, even if you like some Spiderman better than others, or if some villain-actor is more credible than others, the fact of daring to bring together almost all of them despite the fact that some \"belong\" to Sony and others to Disney-Marvel, the result is positive. Another thing is that the theme of the Multiverse is a bit tiring and incoherent at the end."
 },
 {
   "Comment": "The third installment of the Arachnid played by Tom Holland in the MCU is simply a feast for fans of the hero of Queens. With all the tact not to make spoilers, which is difficult if we talk about the film, to say that it has many surprises, that it is dynamic and if you are a follower of the Marvel Universe it grabs you from the beginning and keeps you alert to such a display of surprising elements. Watch also the post-credits scenes and how it starts to grab your attention again."
 },
 {
   "Comment": "My advice is to get carried away by what you see on screen, where the choreographic and design visual spectacularity polarizes that attention, trying not to look for conceivable explanatory realities, but there are so many referenced and interacting characters from the Marvel Multiverse that.... By the way, what is the Multiverse? And yes, I know the subject evolves, but I was much, much more excited by the original Spider-Man. A matter of taste and/or criteria, I argue."
 },
 {
   "Comment": "The movie was disappointing for me overall. I promise I was really looking forward to love it, but I didn't... Second disappointment of the year after \"Black Widow\". There are many problems that take their toll on it and from which it unfortunately does not come out well. The film falls down because of a bad script from the beginning. That said, I think it's appropriate for the first time for me to go into the spoiler zone directly. There are a lot of things I want to unpack, since by now there will be few people who haven't seen this movie yet."
 },
 {
   "Comment": "I have to start by confessing that I don't like Marvel movies. But on this occasion I share that I would like to write in a favorable way about this film, to which I find evolutionary keys to the MCU. In this occasion I applaud under my surprise, to find a film full of development, interesting plot, sought entertainment, incipient surprises and, with a marked weight in a game of multitemporal connection of its different characters converging before their emotions and values."
 },
 {
   "Comment": "The story is composed in a very organic way combining different factors such as action and humor characteristic of the UC, with the characteristics of Holland's Spiderman, along with characteristic elements of the character explored in previous sagas. This makes for a more familiarity with this version of the hero, while giving it a fresh touch. On the side of the performances, each one gives a special touch to his character, besides managing to fit well within the scene itself, especially Williem Dafoe and Alfred Molina."
 },
 {
   "Comment": "It is of great interest the moral questioning that addresses as a reflection, in which enters the linear plot. As well as that the story closes with that certain tone, in which any fight makes everyone lose something to a greater or lesser extent, so it leaves in evidence the theory of the superhero winner. Finally, I think it is impossible not to point out the magnificent role played by the soundtrack in this film, using themes from the previous films as well as those of other characters such as Dr. Strange and fusing them together to achieve a unique soundtrack that works perfectly."
 },
 {
   "Comment": "I don't see in \"No Way Home\" any reason to consider it better than its predecessor \"Far From Home\", despite the unanimous passionate reviews. It is true that the first 10 minutes seem to be heading towards self-criticism and intelligent humor, but my expectations are soon diluted by the triviality of the plot and the usual symphony of special effects. Otherwise, another little Spider-Man adventure with no more interest than pure and simple visual entertainment and a final tribute to the saga. What a pity that James Gunn was not in charge of this production."
 },
 {
   "Comment": "Unexpected. Despite the different theories about the events of the film, it generated a surprising atmosphere. It generates a feeling of joy and intense emotion, nostalgia for characters that many of us remember from our childhood. The special effects are excellent and the story connects the new generation with the old ones, without a doubt, one of the best movies of the UCM."
 },
 {
   "Comment": "The best of Batman, great atmosphere, great performances, beautiful cinematography and very good direction make the film undoubtedly one of the best films in the superhero subgenre and in cinema in general."
 },
 {
   "Comment": "Very good movie has very good aspects, the riddle is a very successful villain and Paul Dano makes a very good interpretation of the character, the photography of the film is impeccable, the soundtrack to say is very good and is used in a very good way throughout the story, Robert Pattinson makes a correct interpretation of Batman and Bruce Wayne, although this Bruce is not a playboy as in other adaptations I think the identity that is given in the film is very good and interesting."
 },
 {
   "Comment": "Very long movie with a poor plot. I didn't like the choices of the actors, it loses the essence of the real Batman. I found it too dark, the Nolan saga is unsurpassed."
 },
 {
   "Comment": "An excellent film that marks a new way of knowing Batman. I recommend it and go with an open head and above all to understand what we are seeing. Excellent acting from Robert Pattinson, to all the co-stars. For me the best Batman movie I've seen."
 },
 {
   "Comment": "For me the worst Batman movie I've seen in my 40 years, forgive me movie critics who analyze it from plot, story, costumes, etc. I analyze it as a fan of BATMAN the ACTION hero who had innovative weapons, spectacular batmobiles, epic fights and brawls between Batman and the villain's henchmen, please !!!! Make something like this again and not this kind of dramatic, sentimental, a batmobile that looks like one of those cars they use to crash and demolish other cars, Batman was always distinguished by his great entrances (in this one you only hear the robocop-like footsteps)."
 },
 {
   "Comment": "In my opinion, \"The Batman\" is a failed attempt, though not at the box office or in terms of audience reception (its score is high), which doesn't change my mind about a fantasy drama that I don't find as entertaining as I would expect it to be. If it doesn't have two hours to spare out of its three hours, at least it has one hour to spare."
 },
 {
   "Comment": "The acting, the cinematography, the scores, the sheer grit and intelligence that portrays each character in this film is what makes this film, truly, a masterpiece. Not all comic book movies are built the same, and Robert Pattinson's first entry as the caped crusader and the world's greatest detective is one for the ages. Kudos to Zoe Kravitz, Jeffrey Wright, John Turturro, Andy Serkis... and a HUGE shout out to Paul Dano and Colin Farrell, who are truly great."
 },
 {
   "Comment": "Robert Pattinson is not the best Batman but the movie is very powerful. It's not your typical Batman movie with big special effects, big doses of action, and so on. It is a dark and cold crime film with moments that intermingle genres as winks of \"Saw\" or \"Seven\". Searching for clues, mysteries, and bad people who seem to be the vast majority. Beware! There will be people who will not like it if you do not like crime movies with the dyes that I comment. The theme of darkness and rain is very well in the footage."
 },
 {
   "Comment": "Although it is inevitable, due to the nature of the character, that traits such as darkness and the decadence and corruption of Gotham (characteristics that are an indivisible part of the comic book character) are shared, both the use of brown and reddish tones and the setting, as well as the approach that Pattinson gives to Bruce/Batman, make the film have its own personality and although in certain things it may remind both Snyder's vision and Nolan's in other nuances, this installment walks very well on its own."
 },
 {
   "Comment": "I think \"Piece of art\" or \"Work of art\" are the best words I have to describe what I just saw. The script is well polished, instead of opting for the same old hero vs. villain story here we have a detective story full of mystery, darkness and even corruption. The choice of Pattinson although a little hard for me to accept it still hit the mark, I didn't feel like I was watching the vampire from twilight, I felt like I was watching Robert Pattinson in the skin of Bruce Wayne. The rest of the cast is no slouch either, each one brings something to the film."
 },
 {
   "Comment": "Another success for DC in this recycled bat, which is more like a film noir than a superhero film. Following the line traced by Christopher Nolan's previous works, the company commissions Matt Reeves (\"Modern Apes\") to direct this \"Batman\" personalized by Robert Pattinson, and continues with the aesthetics of his predecessors \"Batmans\" and his other parallel creations: \"Man of Steel\" and \"Joker\"."
 },
 {
   "Comment": "The Batman, what can I say about this gem, it is a Masterpiece. The Batman is very different from any superhero movie, for me it seemed more like a detective thriller than a movie based on a superhero and I really loved it a lot and I am not one to watch very many detective thrillers. Everything about the movie is wonderful direction, story, music, effects, sounds, photography and the performances of Robert Pattinson, Zoe Kravitz, Paul Dano, Jeffrey Wright, Andy Serkis and Colin Farrell are totally fascinating all have not failed in any scene to be honest none but the performances that I have loved a lot have been those of Pattinson, Kravitz and Dano they three are the ones that have stood out in all the scenes that have appeared they have been very very very very much my attention."
 },
 {
   "Comment": "Of all the superheroes and villains of the comics versioned, the character of Batman is one of those that has achieved the highest average cinematic valuation. The result of this are the multiple stories that have been brought to the billboard, and that have been a blockbuster. The successive styles and perspectives of Tim Burton, Joel Schumacher, Christopher Nolan, or Zack Snyder, have always awakened the commercial interest of the public, making this dynamic and youthful genre gain many points."
 },
 {
   "Comment": "During the first hour, The Batman manages to create a spectacular and sinister atmosphere, which awakens the fascination and admiration of the viewer. We see a hard Batman, ruthless, serious and that hooks you to the plot from the first moment. The problem is that the colossal beginning is not supported by a good script, nor by convincing performances, and from that first hour, the film crumbles disastrously due to a pressing lack of ideas, and ends up giving in to delirium in its final part, which spoils the whole result."
 },
 {
   "Comment": "The problem with The Batman is that it offers nothing new. Many film versions later, this new interpretation only takes advantage of the pull of the superhero to present once again the terrible corruption prevailing in Gotham City, and the bat-man as the solution to all that disaster. A Bruce Wayne lacking in personality, with a pale gray countenance and without a hint of the glamour of yesteryear. And, of course, he will have to face the typical sociopathic pirate without killing anyone, with punches and pirouettes."
 },
 {
   "Comment": "The Batman's beautiful cinematography, excellent score and 10-percent villains are not enough when the main characters are overshadowed by the supporting cast."
 },
 {
   "Comment": "A very innovative plot and good cast. The previews of the movie show that it has good visual effects and that it is set in Bruce Wayne's early years as Batman. The concept of focusing the film on a detective side is interesting because that is what the character is most prominent in the comics."
 },
 {
   "Comment": "It's a serious, dark and quite different movie.... everything a batman fan wants, it also has excellent performances and unlike other movies this one focuses on research topics which I loved... for me: the best superhero movie I've seen."
 },
 {
   "Comment": "It's good but too long, it lacks a lot of violence and the action scenes take up more power, (that the punch is felt). The trailer says enough, I dare say it even sells it to you as something it is not. Moments of great tension (very good) but with anticlimactic resolution. I like this Batman, I want to see more of him but maybe a little more dynamism wouldn't hurt. The riddle is perfect but we are shown very little of him."
 },
 {
   "Comment": "It is a marvel, the only negative thing that could be said about the movie is that it lasts 3 hours and you could easily take 20 minutes off the movie, but in everything else performances, cinematography, soundtrack, story, characters, development etc., everything is 10/10. In my personal opinion, this is the 2nd best Batman movie below The Dark Knight, for me it was just short of surpassing TDK."
 },
 {
   "Comment": "I found it brutal in every way: production design, visual and sound effects, script, action set piece, makeup, PHOTOGRAPHY and that amazing and wonderful SOUNDTRACK by Michael Gianccino - Oscar 2022. On the other hand, the leading cast is superb. And Pattinson makes his own this Batman in his beginnings, much more punk grunge than what had been created so far. A tribute - belated - to Tim Burton and the era that made his personal work of Batman, especially in its second part, much more adult and darker. And therefore, more criticized and less appreciated. Zoe plays a Selina totally identified with the Catwoman of the best works of the character in the comics."
 },
 {
   "Comment": "A plausible version of Batman. I always wanted to see a detective Batman in the movies with a well-developed interesting plot (hopefully the movie will last longer). I loved this newbie Batman who is learning."
 },
 {
   "Comment": "The character study that Batman/Bruce Wayne has, is arguably the best thing about the film. With a very well marked personality both Robert Pattinson's character and the supporting characters are always in tone with the film. Always having real emotions to the characters, not glorifying them. Showing the dark side of them, and letting you see that duality between them, seeming that there is no hero in this movie, only less bad guys. The balance that the film has with the action is very good, always each one proposing something that deepens the plot, not feeling forced any of the 2."
 },
 {
   "Comment": "A very humanized hero in a thriller that keeps you in tension from minute one. The supervillain enigma, will not leave you a second to relax, having to solve the clues given .Cat woman, great, the credible feminine touch of a woman who fights for her ideals. I recommend watching it, even if you are not a Batman fan. Three hours that you will not appreciate, because of how fast they go."
 },
 {
   "Comment": "A film of loves and hates; I consider that this feature film succeeds with its dark atmosphere and faithful to the essence of Batman, it also succeeds in the clear intention of the director (somewhat different from the previous Batmans) to expose his bat-man as a vengeful and depressed subject, and that's as far as it goes... Pattinson's character tries to argue his depression based on his family and social environment, but the truth is that the most depressing thing I find is his insipid and flat performance."
 },
 {
   "Comment": "The overall pacing is relentless and the sequel shows its hand a lot earlier than you'd expect. There's been endless speculation from fans about the villain, which i won't spoil here, but it's revealed surprisingly quickly. You can't help that feel somewhere in the multiverse, there's a better version of this movie that exists."
 }
]